/* ==
   FILE: chapters/chapter01.js
   描述: 第1章 随机事件和概率
   == */

chapter('随机事件和概率')          
  .text('随机现象在自然界、生产实践、科学实验和日常生活中发生的现象,按其结果能否准确预测来划分,可以分为两大类：一类是必然现象.另一类是随机现象.')
    .text('在一定条件下,可能会出现多种不同的结果,但在观测之前无法预知其确切结果的现象,称为随机现象.这类现象的共同特点是：在相同条件下可重复进行试验,但每次试验不止出现一个结果,即试验结果呈现出不确定性.')
    .text(' 事实上,在个别试验中,随机现象的结果虽然呈现出不确定性,但是经多次重复试验,却可发现它仍然呈现出某种规律性,这种规律性称为随机事件的统计规律性.')
    .section('随机事件')
    .subsection('随机试验')
    .definition('随机试验', `
      满足下列三个条件的试验称为随机试验：
      <ul>
        <li>试验在相同条件下可重复进行.</li>
        <li>每次试验的可能结果不止一个,但能事先明确试验的所有可能结果.</li>
        <li>每次试验前不能确定哪一个结果发生.</li>
      </ul>
      随机试验简称试验,常用字母$E_{1}, E_{2}, \\cdots$表示.
    `)
  .subsection('样本空间')
    .definition('样本空间与样本点', `
      对于任一个随机试验,每次实验的所有可能结果都是事先知道的,而且结果不止一个.把随机试验的一切可能结果的集合称为样本空间.在概率论中常用大写的希腊字母$\\Omega$来表示.<br>试验的每个结果称之为样本点或基本事件,通常用小写的希腊字母$\\omega$或$\\omega_{1}, \\omega_{2}, \\cdots$来表示.
    `)
    .subsection('随机事件')
    .text('在实际问题中,我们往往关心某种满足一定条件样本点的集合,这种满足一定条件样本的集合称为随机事件,简称事件.所以随机事件就是某些样本点的集合,也就是样本空间$\\Omega$的某些子集合.')
    .definition('必然事件、不可能事件', `在试验时,如果出现了事件$A$中的样本点,我们就说事件$A$发生了或者说$A$出现了.<ul>
      <li>$\\Omega$作为自身的子集合,在每次试验中总是发生的,称为必然事件</li>
      <li>空集$\\varnothing$不包含任何样本点,在每次试验中总是不发生,称为不可能事件.</li>
      <li>事件通常用大写的英文字母$A, B, C, \\cdots$表示.</li>
      </ul>
    `)
  .subsection('事件间的关系与运算')
    .definition('事件间的关系与运算（集合论）', `
      事件是$\\Omega$的子集合,它们之间的关系与运算即集合间的关系与运算.下面设$A, B, A_{1}, A_{2}, \\cdots$均为事件.
      <ol>
        <li>（包含）若$A \\subset B$,则称$B$包含事件$A$或$A$含于$B$.这表示事件$A$发生必导致$B$发生.<br>
  若$A \\subset B$,且$B \\subset A$,即$A = B$,则称事件$A$与$B$相等.</li>
        <li>（并事件）事件$A \\cup B = \\{\\omega \\in \\Omega: \\omega \\in A$ 或 $\\omega \\in B\\}$,称为事件$A$与$B$的并事件.$A \\cup B$发生当且仅当$A, B$中至少有一个发生.<br>
  类似地,称$\\bigcup_{i=1}^{n} A_{i} = \\{\\omega \\in \\Omega: \\omega$至少属于$A_{1}, A_{2}, \\cdots, A_{n}$中一个事件$\\}$为$n$个事件的并事件,称$\\bigcup_{i=1}^{\\infty} A_{i} = \\{\\omega \\in \\Omega: \\omega$至少属于$A_{1}, A_{2}, \\cdots$中一个事件$\\}$为可列个事件的并事件.</li>
        <li>（交事件）事件$A \\cap B = \\{\\omega \\in \\Omega: \\omega \\in A$并且$\\omega \\in B\\}$称为事件$A$与$B$的交事件,简记为$AB$.$AB$发生当且仅当$A$与$B$同时发生.<br>
  类似地,称$\\bigcap_{i=1}^{n} A_{i} = \\{\\omega \\in \\Omega: \\omega$属于一切$A_{i}, i=1,2,\\cdots,n\\}$为$n$个事件的交事件,称$\\bigcap_{i=1}^{\\infty} A_{i} = \\{\\omega \\in \\Omega: \\omega$属于一切$A_{1}, A_{2}, \\cdots\\}$为可列个事件的交事件.</li>
        <li>（差事件）事件$A - B = \\{\\omega \\in \\Omega: \\omega \\in A$但$\\omega \\notin B\\}$称为事件$A$与$B$的差事件,事件$A - B$发生当且仅当$A$发生,而$B$不发生.</li>
        <li>（互不相容）若$A \\cap B = \\varnothing$,则称事件$A$与$B$互不相容或互斥,即两事件不能同时发生.</li>
        <li>（逆事件）若$A \\cup B = \\Omega$,且$A \\cap B = \\varnothing$,则称两事件互为逆事件,并记$B = \\overline{A}$或$A = \\overline{B}$.</li>
      </ol>
    `)
    .property('事件运算的性质', `
      <ol>
        <li>交换律：$$A \\cup B = B \\cup A \\quad A \\cap B = B \\cap A$$</li>
        <li>结合律：$$
  \\begin{align*}A \\cup (B \\cup C) = (A \\cup B) \\cup C\\\\
    \A \\cap (B \\cap C) = (A \\cap B) \\cap C\\end{align*}$$</li>
        <li>分配律：$$\\begin{align*}A \\cap (B \\cup C) = (A \\cap B) \\cup (A \\cap C)\\\\
        \A \\cup (B \\cap C) = (A \\cup B) \\cap (A \\cup C)\\end{align*}$$</li>
        <li>对偶律：$$\\overline{A \\cup B} = \\overline{A} \\cap \\overline{B}\\quad\\overline{A \\cap B} = \\overline{A} \\cup \\overline{B}$$</li>
      </ol>
      
    `)
  .section('概率的定义')
    .text(`概率定义引言
      1.1节介绍了随机现象,通过大量试验可以观察到会有哪些结果出现.实际上,我们更希望能对这些结果出现的可能性作出定量的描述.事件发生可能性的定量描述的实质就是事件发生的概率.有些事件发生的概率直觉就可以确定,但是,对于一般事件而言,单凭直觉来确定其发生的概率显然是行不通的．
    `)
  .subsection('概率的统计定义')
    .definition('频率与频数', `
      若事件$A$在$n$次试验中发生了$n_A$次,则称$n_A$为事件$A$在这$n$次试验中发生的频数,而比值$f_n(A)=\\frac{n_A}{n}$称为事件$A$在这$n$次试验中发生的频率.
    `)
    .property('频率的性质', `
      <ol>
        <li>（有界性）对于任何一个事件$A$,有$0 \\leqslant f_n(A) \\leqslant 1$.</li>
        <li>（规范性）$f_n(\\Omega)=1, f_n(\\varnothing)=0$.</li>
        <li>（有限可加性）$$f_n(A \\cup B)=f_n(A)+f_n(B)-f_n(AB)$$特别地,若$A,B$互不相容,则有$$f_n(A+B)=f_n(A)+f_n(B)$$</li>
        <li>（对立事件）$f_n(\\overline{A})=1-f_n(A)$.</li>
        <li>（单调性）若$A \\subset B$,则有$f_n(A) \\leqslant f_n(B)$,且$f_n(B-A)=f_n(B)-f_n(A)$.</li>
      </ol>
    `)
    .definition('概率的统计定义', `
      事件$A$出现的频率$f_n(A)$随着重复试验的次数$n$的增大而稳定于某个常数$p$,则称这个常数$p$为事件$A$发生的概率,记为$P(A)$,即$P(A)=p$.
    `)
    .text(`由频率的稳定性可知,任一个事件$A$的概率是客观存在的．但在实际问题中,常常并不知道$P(A)$为何值,此时可取试验次数”足够大时$A$出现的频率作为它的近似值,这正是统计定义的优点`)
  .subsection('概率的公理化定义')
  .text(`由概率的统计定义容易估计事件$A$发生的概率,但是,在实践中,人们不可能对每一事件都做大量的试验,为了理论研究的需要, 1933 年苏联数学家柯尔莫哥洛夫提出的概率公理化定义,其概括了历史上几种概率定义中的共有特性,又避免了各自的局限性和含混之处,不管什么随机现象,只有满足定义中的三条公理,才能说它是概率．这个定义给予了概率论严格的数学基础,并使得概率论的研究方法和结果能用于其他的科学领域．`)
    .definition('概率的公理化定义', `
      设随机试验$E$的样本空间为$\\Omega$,对$E$的每一个事件$A$赋予一个实值函数$P(A)$,称其为事件$A$的概率,如果集合函数$P(A)$满足下列三条公理：
      <ol>
        <li>（非负性）对任意事件$A$,有$P(A) \\geqslant 0$.</li>
        <li>（规范性）对必然事件$\\Omega$,有$P(\\Omega)=1$.</li>
        <li>（可列可加性）对于可数个两两互斥的事件$A_1, A_2, \\cdots, A_n, \\cdots$,有$$P(\\bigcup\\limits_{i=1}^{\\infty}A_i)=\\sum\\limits_{i=1}^{\\infty}P(A_i)$$</li>
      </ol>
    `)
    .property('概率的基本性质', `
      <ol>
        <li>对任意事件$A$,有$0 \\leqslant P(A) \\leqslant 1$.</li>
        <li>$P(\\Omega)=1, \\quad P(\\varnothing)=0$.</li>
        <li>（加法公式）$$P(A \\cup B)=P(A)+P(B)-P(AB)$$特别地,若$A,B$互不相容,则有$$P(A+B)=P(A)+P(B)$$</li>
      </ol>
    `)
    .corollary('概率加法公式的推广（三个事件）', 
      '设$A, B, C$为三个事件,则'+
      formula(
      'P(A \\cup B \\cup C)=P(A)+P(B)+P(C)-P(AB)-P(BC)-P(AC)+P(ABC)',{label:'corollary1.1'})+
    '特别地,若$A,B$互不相容,则有$$P(A+B)=P(A)+P(B)$$'
    )
    .text(`
     \\ref{corollary1.1} 还可以推广为:若$A_1, A_2, \\cdots, A_m$两两互不相容,则有
      $$P(A_1+A_2+\\cdots+A_m)=P(A_1)+P(A_2)+\\cdots+P(A_m).$$
      这称为概率的有限可加性.
    `)
    
  .subsection('古典概型')
    .definition('古典概型（古典随机试验）', `
      若一个随机试验满足：
      <ol>
        <li>试验的样本空间中只有有限个样本点（有限性）.</li>
        <li>试验中每个样本点的出现是等可能的（等可能性）.</li>
      </ol>
      则称该随机试验为古典随机试验,相应的模型称为古典概型.
    `)
    .definition('古典概型中事件的概率', `
      设古典概型的样本空间$\\Omega=\\{\\omega_1, \\omega_2, \\cdots, \\omega_n\\}$,若事件$A$中含有$k(k \\leqslant n)$个样本点,则称$\\frac{k}{n}$为事件$A$发生的概率,记为
      $$P(A)=\\frac{\\text{事件A包含的基本事件数}}{\\Omega\\text{中基本事件的总数}}=\\frac{k}{n}.$$
    `)
    .text( `
      对于古典概型,若样本空间的样本点为$\\omega_1, \\omega_2, \\cdots, \\omega_n$,则$$P(\\omega_1)=P(\\omega_2)=\\cdots=P(\\omega_n)=\\frac{1}{n}$$
    `)
  .subsection('几何概型')
    .text(`
      如果一个随机试验的样本空间$\\Omega$是一个大小可以度量的几何区域,向$\\Omega$区域内任意投掷一个点,这个点落在$\\Omega$中任何一点的可能性是相同的,则称此试验为几何概型.
    `)
    .definition('几何概型中事件的概率', ` 设试验$E$的结果可用某一区域$\\Omega$内的点的随机位置来确定,且点落在$\\Omega$中的任意位置是等可能的．事件$A$表示点落在$\\Omega$的某一子区域内,该子区域仍记为$A$. 用$\\mu(A)$表示子区域$A$的度量（可表示区间的长度；平面面积和空间体积）,则事件的概率为
      $$P(A)=\\frac{\\mu(A)}{\\mu(\\Omega)}$$`)
  .section('条件概率、全概率公式和贝叶斯公式')
  .subsection('条件概率')
  .text(`在自然界及人类的活动中,有许多事物是相互联系、相互影响的,在概率论中,除了要考虑事物$B$发生的概率$P(B)$之外,有时还要考虑“事件$A$已经发生”的条件下事件$B$发生的概率,记为$P(B|A)$. 一般而言,这两个概率是不相同的,请看下面的例子．`)
  .example('箱中有同型号的产品 $7$ 件,其中 $4$ 件正品,$3$ 件次品,无放回地抽取 $2$ 次,每次取一件.<ol><li>求第二次取到次品的概率</li><li>已知第一次取到的是正品,求第二次取到次品的概率</li></ol>')
  .text('解:设 $A=\\{\\text{第一次取到正品}\\}$, $B=\\{\\text{第二次取到次品}\\}$.<br>(1) 要求 $P(B)$,因基本事件总数为从 $7$ 件产品中任取 $2$ 件的排列数 $P_{7}^{2}$,事件 $B$ 发生相当于先由 $3$ 件次品中取 $1$ 件排在第二位置,又由余下的 $6$ 件产品中任取 $1$ 件排在第一位置,故 $B$ 所包含的基本事件数为 $P_{3}^{1} P_{6}^{1}$,从而$$P(B) = \\frac{P_{3}^{1} P_{6}^{1}}{P_{7}^{2}} = \\frac{3 \\times 6}{7 \\times 6} = \\frac{3}{7}.$$(2) 因为已经知道第一次取到正品,余下的 $6$ 件产品中仍有 $3$ 件次品,此时取到次品的概率显然为 $3/6$,即$$P(B|A) = \\frac{3}{6} = \\frac{1}{2}$$从上例可见,$P(B|A) \\neq P(B)$.产生两式不等的原因是,当事件 $A$ 发生后,可供选择的样本点的范围缩小了,故这时再发生事件 $B$ 的可能性就起了变化.下面我们从古典概型出发导出条件概率的定义.')
  .text('设$\\Omega$ 所包含的基本事件总数为 $n$,$A$ 与 $AB$ 所包含的基本事件数分别为 $n_A$ 与 $n_{AB}$.因为在 $A$ 发生的条件下有 $n_A$ 个基本事件发生,其中只有 $AB$ 所包含的 $n_{AB}$ 个基本事件有利于 $B$ 发生,所以$$P(B|A) = \\frac{n_{AB}}{n_A} = \\frac{n_{AB} / n}{n_A / n} = \\frac{P(AB)}{P(A)}$$由此出发,可以给出条件概率的一般定义.')
  .definition('条件概率', `设$A, B$为随机试验$E$上的两个事件,且$P(A) > 0$,则在事件$A$发生的条件下事件$B$发生的概率称为条件概率,记为 $P(B|A)$,定义为
$$
P(B|A) = \\frac{P(AB)}{P(A)}
$$`)
  .remark('计算条件概率$P(B|A)$有两种方法:<ol><li>在样本空间的缩减样本空间中计算$B$发生的概率,求得$P(B|A)$.</li><li>在样本空间中计算 $P(AB) , P(A)$,再由关系式计算 $P(B|A)$.</li></ol>')
    .property('条件概率的性质', `
      条件概率满足概率的三条公理,即
      <ol>
        <li>（非负性）对于每一事件$B$,有$P(B|A) \\geq 0$.</li>
        <li>（规范性）$P(\\Omega|A) = 1$.</li>
        <li>（可列可加性）设$B_1, B_2, \\cdots$是两两互不相容的事件,则有
        $$P(\\bigcup_{i=1}^{\\infty} B_i | A) = \\sum_{i=1}^{\\infty} P(B_i | A).$$</li>
      </ol>
      因此,对条件概率,概率的一切性质同样成立.
    `)
  .subsection('乘法公式')
    .theorem('乘法公式', `
      设$A, B$是两个事件,且$P(A) > 0$,则有
      $$P(AB) = P(A)P(B|A)$$
      同理,若$P(B) > 0$,则有
      $$P(AB) = P(B)P(A|B).$$
    `)
    .theorem('多个事件的乘法公式', `
      设$A,B,C$为三个事件,且$P(AB) > 0$,则有
    $$P(ABC) = P(A)P(B|A)P(C|AB)$$  设$A_1, A_2, \\cdots, A_n$为$n$个事件,且$P(A_1A_2 \\cdots A_{n-1}) > 0$,则有
      $$P(A_1A_2 \\cdots A_n) = P(A_1)P(A_2|A_1)P(A_3|A_1A_2) \\cdots P(A_n|A_1A_2 \\cdots A_{n-1}).$$
    `)
  .subsection('全概率公式与贝叶斯公式')
  .text(`全概率公式与贝叶斯公式是概率论的两个重要公式,用它可简化许多困难的概率计算.`)
    .definition('完备事件组（划分）', `
      设试验$E$的样本空间为$\\Omega$,事件$B_1, B_2, \\cdots, B_n$互不相容,即:
      <ol>
        <li>$B_iB_j = \\varnothing, i \\neq j, i, j=1,2,\\cdots,n$.</li>
        <li>$\\bigcup_{i=1}^{n} B_i = \\Omega$.</li>
      </ol>
      则称$B_1, B_2, \\cdots, B_n$为样本空间$\\Omega$的一个完备事件组（或称$\\Omega$的一个划分）.若$B_1, B_2, \\cdots, B_n$是$\\Omega$的划分,则每次实验中$B_1, B_2, \\cdots, B_n$有且只有一个发生.
    `)
    .theorem('全概率公式', `
      设试验$E$的样本空间为$\\Omega$,$B_1, B_2, \\cdots, B_n$是样本空间$\\Omega$的一个完备事件组,且$P(B_i) > 0(i=1,2,\\cdots,n)$,$A$为$E$的一个事件,则
      $$P(A) = \\sum_{i=1}^{n} P(A|B_i)P(B_i)$$
    `)
    .theorem('贝叶斯(Bayes)公式（逆概率公式）', `
      设试验$E$的样本空间为$\\Omega$,$B_1, B_2, \\cdots, B_n$是$\\Omega$的一个完备事件组,且$P(B_i) > 0(i=1,2,\\cdots,n)$,$A$为$E$的一个事件,且$P(A)>0$,则
      $$P(B_i|A)  = \\frac{P(B_i)P(A|B_i)}{P(A)}= \\frac{P(B_i)P(A|B_i)}{\\sum_{j=1}^{n} P(B_j)P(A|B_j)}, \\quad i=1,2,\\cdots,n.$$
    `)
    .text(`这个公式称为贝叶斯公式,在概率论与数理统计中有重要应用．我们把$A$看成为试验的结果,$B_i$, 看成为产生这个结果的“原因”,$P(B_i)$称为先验概率,它表示各种“原因”发生的可能性的大小,一般可根据以往经验与数据来确定．若事件$A$出现,这个信息将帮助我们探索事件发生的“原因”,称这个条件概率$P(B_i|A)$为后验概率．`)
  .section('事件的独立性')
  .text(`设 $A, B$ 是两个事件,若 $P(A) > 0$,则可以定义 $P(B|A) = \\frac{P(AB)}{P(A)}$.一般而言,$P(B|A) \\neq P(B)$,这表明事件 $A$ 的发生对事件 $B$ 发生的概率有影响.只有当这种影响不存在,即 $P(B|A) = P(B)$ 时,才有
$$
P(AB) = P(A)P(B).
$$
此时称事件 $A$ 与 $B$ 相互独立.`)
    .definition('两个事件独立', `
      设$A, B$是两个事件,如果满足$P(AB) = P(A)P(B)$,则称事件$A$与$B$相互独立,简称$A, B$独立.
    `)
    .text(`显然,两个事件独立是指两事件的发生互不影响对方发生的概率,从而独立是相互的.因此,当已知 $A$,$B$ 独立时,有 $B$,$A$ 也独立.从而 $P(A) = P(A|B)$ 成立.
<br>
另一方面,若 $A$,$B$ 独立,则由乘法公式有
$$
P(AB) = P(A)P(B|A) = P(A)P(B).
$$

同时,若 $P(AB) = P(A)P(B)$ 成立,由条件概率有
$$
P(B|A) = \\frac{P(AB)}{P(A)} = \\frac{P(A)P(B)}{P(A)} = P(B)
$$

这表明 $P(B) = P(B|A)$ 与 $P(AB) = P(A)P(B)$ 的表达是等价的,从而得到两个事件独立的第二种表述.`)
    .definition('两个事件独立的等价定义',`
若两事件$A,B$满足$ P(AB)=P(A)P(B)$,则称事件$A,B$相互独立,简称$A,B$独立.`)
    .text(`
值得注意的是,事件的独立性与互斥是两码事.互斥表示两个事件不能同时发生,而独立性则表示它们彼此互不影响对方发生的概率.当 $P(A)>0$,$P(B)>0$ 时,若 $A,B$ 相互独立,则
$$
P(AB)=P(A)P(B) > 0;
$$
若 $A,B$ 互斥,则
$$
P(AB)=P(\\varnothing) = 0.
$$
此时,$A,B$ 相互独立和 $A,B$ 互斥不会同时成立.`)
    .definition('三个事件两两独立', `
      设$A, B, C$是三个事件,如果满足等式
      $$\\begin{cases}P(AB)=P(A)P(B)\\\\P(AC)=P(A)P(C)\\\\P(BC)=P(B)P(C)\\end{cases}$$
      则称事件$A, B, C$两两独立.
    `)
    .definition('三个事件相互独立', `
      设$A, B, C$是三个事件,如果满足
      $$\\begin{cases}P(AB)=P(A)P(B)\\\\P(AC)=P(A)P(C)\\\\P(BC)=P(B)P(C)\\\\P(ABC)=P(A)P(B)P(C)\\end{cases}$$
      则称事件$A, B, C$相互独立.
    `)
    .definition('$n$个事件相互独立', `
      设有$n$个事件$A_1, A_2, \\cdots, A_n$,如果满足      $$\\begin{cases}
  P(A_{i}A_{j})=P(A_i)P(A_j),\\quad \\forall i \\neq j\\\\
  P(A_{i}A_{j}A_{k})=P(A_i)P(A_j)P(A_k),\\quad\\forall i \\neq j\\neq k\\\\
  \\cdots\\\\
  P(A_{1}A_{2}\\cdots A_{n})=P(A_1)P(A_2)\\cdots P(A_n)
  \\end{cases}$$
      则称事件$A_1, A_2, \\cdots, A_n$相互独立.
    `)
  .section('伯努利概型')
    .definition('独立重复试验', `
      若在相同条件下,将某个随机试验重复进行$n$次,且每次试验中任一事件的概率不受其他各次试验结果的影响,则称这$n$次试验为$n$次独立重复试验.
    `)
    .definition('伯努利试验', `
      如果随机试验只有两个可能结果：$A$与$\\overline{A}$,其中$$P(A)=p, P(\\overline{A})=1-p=q, 0 < p < 1$$
  则称该试验为伯努利试验.<br>
      独立地重复$n$次伯努利试验,称为$n$重伯努利试验,也称伯努利概型.在$n$重伯努利试验中,我们将事件$A$发生$k$次的概率记作$B(k;n,p)$.
    `)
    .theorem('伯努利概型的概率计算公式', `
      设在一次试验中事件$A$发生的概率为$p(0 < p < 1)$,$q=1-p$,则在$n$重伯努利试验中,事件$A$恰好发生$k$次的概率      $$B(k;n,p)=C_{n}^{k}p^{k}q^{n-k},\\quad k=0,1,2,\\cdots,n$$
    `)
    
